cask_args appdir: '/Applications'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core' 

# brew 'ansible'
brew 'bat'
brew 'binutils'
# brew 'chruby'
brew 'coreutils'
# brew 'dep' 
brew 'diffutils'
brew 'findutils'
brew 'fzf'
brew 'gawk'
# brew 'gdb'
brew 'git'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'go'
brew 'gpg2'
brew 'graphviz'
brew 'grep'
brew 'grip'
brew 'gzip'
# brew 'hub'
# brew 'hugo'
brew 'jq'
# brew 'lua'
brew 'make'
brew 'mas'
# brew 'neofetch'
brew 'neovim'
# brew 'nmap'
# brew 'node'
# brew 'openssl'
# brew 'openvpn'
# brew 'pcre'
brew 'perltidy'
brew 'pipenv'
# brew 'powerline-go'
brew 'python3'
brew 'rsync'
# brew 'ruby-build'
# brew 'ruby-install'
# brew 'rust'
brew 'shellcheck'
brew 'starship'
# brew 'terraform'
brew 'tmux'
brew 'tor'
brew 'transmission'
# brew 'unrar'
brew 'upx'
# brew 'vim', args: ['with-lua']
# brew 'watch'
# brew 'wget'
brew 'zoxide'
brew 'zsh'
brew 'zsh-syntax-highlighting'


cask 'amazon-workspaces'
# cask 'calibre'
# cask 'dashlane'
# cask 'firefox'
cask 'font-fira-code'
# cask 'goland'
# cask 'google-chrome'
cask 'grammarly'
# cask 'handbrake'
cask 'hyper'
# brew 'imagemagick'
# cask 'iterm2'
cask 'keepassxc'
# cask 'kindle'
# cask 'mactex'
cask 'onedrive'
# cask 'osxfuse'
# cask 'pycharm'
cask 'slack'
cask 'spotify'
# cask 'steam'
# cask 'sublime-text'
# cask 'vagrant'
cask 'veracrypt'
# cask 'virtualbox'
cask 'visual-studio-code'
cask 'vmware-fusion'
cask 'vlc'
# cask 'zoom'

