cask_args appdir: '/Applications'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'

# brew 'ansible'
# brew 'awscli'
# brew 'bat'
brew 'binutils'
# brew 'chruby'
brew 'coreutils'
# brew 'dep'
brew 'diffutils'
brew 'findutils'
# brew 'fzf'
brew 'gawk'
# brew 'gdb'
brew 'git'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'go'
brew 'gnupg'
# brew 'graphviz'
brew 'grep'
brew 'grip'
brew 'gzip'
brew 'hub'
# brew 'hugo'
brew 'jq'
# brew 'lua'
brew 'make'
brew 'mas'
# brew 'mu-editor'
# brew 'neofetch'
brew 'neovim'
# brew 'nmap'
# brew 'node'
# brew 'openssl'
# brew 'openvpn'
# brew 'pcre'
# brew 'perltidy'
brew 'pipenv'
# brew 'powerline-go'
brew 'python3'
brew 'rsync'
# brew 'ruby-build'
# brew 'ruby-install'
# brew 'rust'
brew 'shellcheck'
brew 'starship'
# brew 'terraform'
# brew 'telnet'
brew 'tmux'
# brew 'tor'
# brew 'transmission-cli'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
# brew 'unrar'
# brew 'upx'
# brew 'vim', args: ['with-lua']
# brew 'watch'
# brew 'wget'
# brew 'zoxide'
brew 'zsh'
brew 'zsh-syntax-highlighting'

cask 'alacritty'
# cask 'alfred'
# cask 'amazon-workspaces'
# cask 'calibre'
# cask 'dashlane'
# cask 'discord'
# cask 'firefox'
# cask 'google-chrome'
cask 'font-fira-code'
cask 'gitkraken'
cask 'grammarly'
# cask 'handbrake'
# cask 'hyper'
# brew 'imagemagick'
# cask 'iterm2'
cask 'keepassxc'
# cask 'kindle'
# cask 'mactex'
cask 'onedrive'
# cask 'osxfuse'
# cask 'signal'
cask 'slack'
cask 'spotify'
# cask 'steam'
# cask 'sublime-text'
# cask 'telegram-desktop'
# cask 'transmission'
# cask 'vagrant'
# cask 'veracrypt'
# cask 'virtualbox'
cask 'visual-studio-code'
# cask 'vmware-fusion'
cask 'vlc'
cask 'zoom'

# Mac App Store
mas 'Grammerly for Safari', id: 1462114288
mas 'Keeper', id: 414781829
mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825
mas 'OmniFocus 3', id: 1346203938
# mas 'OmniOutliner 5', id: 1142578772
# mas 'Pages', id: 409201541
# mas 'Telegram Light', id: 946399090
# mas 'Transmit 5', id: 1436522307
mas 'Ulysses', id: 1225570693
mas 'Unarchiver', id: 425424353


